spezzz/LM3S316-SIMPLEADC/lm3slib/driverlib/rom_map.h
//*****************************************************************************
//
// rom_map.h - Macros to facilitate calling functions in the ROM when they are
//             available and in flash otherwise.
//
// Copyright (c) 2008-2011 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 7243 of the Stellaris Peripheral Driver Library.
//
//*****************************************************************************

#ifndef __ROM_MAP_H__
#define __ROM_MAP_H__

//*****************************************************************************
//
// Macros for the ADC API.
//
//*****************************************************************************
#ifdef ROM_ADCSequenceDataGet
#define MAP_ADCSequenceDataGet \
        ROM_ADCSequenceDataGet
#else
#define MAP_ADCSequenceDataGet \
        ADCSequenceDataGet
#endif
#ifdef ROM_ADCIntDisable
#define MAP_ADCIntDisable \
        ROM_ADCIntDisable
#else
#define MAP_ADCIntDisable \
        ADCIntDisable
#endif
#ifdef ROM_ADCIntEnable
#define MAP_ADCIntEnable \
        ROM_ADCIntEnable
#else
#define MAP_ADCIntEnable \
        ADCIntEnable
#endif
#ifdef ROM_ADCIntStatus
#define MAP_ADCIntStatus \
        ROM_ADCIntStatus
#else
#define MAP_ADCIntStatus \
        ADCIntStatus
#endif
#ifdef ROM_ADCIntClear
#define MAP_ADCIntClear \
        ROM_ADCIntClear
#else
#define MAP_ADCIntClear \
        ADCIntClear
#endif
#ifdef ROM_ADCSequenceEnable
#define MAP_ADCSequenceEnable \
        ROM_ADCSequenceEnable
#else
#define MAP_ADCSequenceEnable \
        ADCSequenceEnable
#endif
#ifdef ROM_ADCSequenceDisable
#define MAP_ADCSequenceDisable \
        ROM_ADCSequenceDisable
#else
#define MAP_ADCSequenceDisable \
        ADCSequenceDisable
#endif
#ifdef ROM_ADCSequenceConfigure
#define MAP_ADCSequenceConfigure \
        ROM_ADCSequenceConfigure
#else
#define MAP_ADCSequenceConfigure \
        ADCSequenceConfigure
#endif
#ifdef ROM_ADCSequenceStepConfigure
#define MAP_ADCSequenceStepConfigure \
        ROM_ADCSequenceStepConfigure
#else
#define MAP_ADCSequenceStepConfigure \
        ADCSequenceStepConfigure
#endif
#ifdef ROM_ADCSequenceOverflow
#define MAP_ADCSequenceOverflow \
        ROM_ADCSequenceOverflow
#else
#define MAP_ADCSequenceOverflow \
        ADCSequenceOverflow
#endif
#ifdef ROM_ADCSequenceOverflowClear
#define MAP_ADCSequenceOverflowClear \
        ROM_ADCSequenceOverflowClear
#else
#define MAP_ADCSequenceOverflowClear \
        ADCSequenceOverflowClear
#endif
#ifdef ROM_ADCSequenceUnderflow
#define MAP_ADCSequenceUnderflow \
        ROM_ADCSequenceUnderflow
#else
#define MAP_ADCSequenceUnderflow \
        ADCSequenceUnderflow
#endif
#ifdef ROM_ADCSequenceUnderflowClear
#define MAP_ADCSequenceUnderflowClear \
        ROM_ADCSequenceUnderflowClear
#else
#define MAP_ADCSequenceUnderflowClear \
        ADCSequenceUnderflowClear
#endif
#ifdef ROM_ADCProcessorTrigger
#define MAP_ADCProcessorTrigger \
        ROM_ADCProcessorTrigger
#else
#define MAP_ADCProcessorTrigger \
        ADCProcessorTrigger
#endif
#ifdef ROM_ADCHardwareOversampleConfigure
#define MAP_ADCHardwareOversampleConfigure \
        ROM_ADCHardwareOversampleConfigure
#else
#define MAP_ADCHardwareOversampleConfigure \
        ADCHardwareOversampleConfigure
#endif
#ifdef ROM_ADCComparatorConfigure
#define MAP_ADCComparatorConfigure \
        ROM_ADCComparatorConfigure
#else
#define MAP_ADCComparatorConfigure \
        ADCComparatorConfigure
#endif
#ifdef ROM_ADCComparatorRegionSet
#define MAP_ADCComparatorRegionSet \
        ROM_ADCComparatorRegionSet
#else
#define MAP_ADCComparatorRegionSet \
        ADCComparatorRegionSet
#endif
#ifdef ROM_ADCComparatorReset
#define MAP_ADCComparatorReset \
        ROM_ADCComparatorReset
#else
#define MAP_ADCComparatorReset \
        ADCComparatorReset
#endif
#ifdef ROM_ADCComparatorIntDisable
#define MAP_ADCComparatorIntDisable \
        ROM_ADCComparatorIntDisable
#else
#define MAP_ADCComparatorIntDisable \
        ADCComparatorIntDisable
#endif
#ifdef ROM_ADCComparatorIntEnable
#define MAP_ADCComparatorIntEnable \
        ROM_ADCComparatorIntEnable
#else
#define MAP_ADCComparatorIntEnable \
        ADCComparatorIntEnable
#endif
#ifdef ROM_ADCComparatorIntStatus
#define MAP_ADCComparatorIntStatus \
        ROM_ADCComparatorIntStatus
#else
#define MAP_ADCComparatorIntStatus \
        ADCComparatorIntStatus
#endif
#ifdef ROM_ADCComparatorIntClear
#define MAP_ADCComparatorIntClear \
        ROM_ADCComparatorIntClear
#else
#define MAP_ADCComparatorIntClear \
        ADCComparatorIntClear
#endif
#ifdef ROM_ADCReferenceSet
#define MAP_ADCReferenceSet \
        ROM_ADCReferenceSet
#else
#define MAP_ADCReferenceSet \
        ADCReferenceSet
#endif
#ifdef ROM_ADCReferenceGet
#define MAP_ADCReferenceGet \
        ROM_ADCReferenceGet
#else
#define MAP_ADCReferenceGet \
        ADCReferenceGet
#endif
#ifdef ROM_ADCPhaseDelaySet
#define MAP_ADCPhaseDelaySet \
        ROM_ADCPhaseDelaySet
#else
#define MAP_ADCPhaseDelaySet \
        ADCPhaseDelaySet
#endif
#ifdef ROM_ADCPhaseDelayGet
#define MAP_ADCPhaseDelayGet \
        ROM_ADCPhaseDelayGet
#else
#define MAP_ADCPhaseDelayGet \
        ADCPhaseDelayGet
#endif

//*****************************************************************************
//
// Macros for the CAN API.
//
//*****************************************************************************
#ifdef ROM_CANIntClear
#define MAP_CANIntClear \
        ROM_CANIntClear
#else
#define MAP_CANIntClear \
        CANIntClear
#endif
#ifdef ROM_CANInit
#define MAP_CANInit \
        ROM_CANInit
#else
#define MAP_CANInit \
        CANInit
#endif
#ifdef ROM_CANEnable
#define MAP_CANEnable \
        ROM_CANEnable
#else
#define MAP_CANEnable \
        CANEnable
#endif
#ifdef ROM_CANDisable
#define MAP_CANDisable \
        ROM_CANDisable
#else
#define MAP_CANDisable \
        CANDisable
#endif
#ifdef ROM_CANBitTimingSet
#define MAP_CANBitTimingSet \
        ROM_CANBitTimingSet
#else
#define MAP_CANBitTimingSet \
        CANBitTimingSet
#endif
#ifdef ROM_CANBitTimingGet
#define MAP_CANBitTimingGet \
        ROM_CANBitTimingGet
#else
#define MAP_CANBitTimingGet \
        CANBitTimingGet
#endif
#ifdef ROM_CANMessageSet
#define MAP_CANMessageSet \
        ROM_CANMessageSet
#else
#define MAP_CANMessageSet \
        CANMessageSet
#endif
#ifdef ROM_CANMessageGet
#define MAP_CANMessageGet \
        ROM_CANMessageGet
#else
#define MAP_CANMessageGet \
        CANMessageGet
#endif
#ifdef ROM_CANStatusGet
#define MAP_CANStatusGet \
        ROM_CANStatusGet
#else
#define MAP_CANStatusGet \
        CANStatusGet
#endif
#ifdef ROM_CANMessageClear
#define MAP_CANMessageClear \
        ROM_CANMessageClear
#else
#define MAP_CANMessageClear \
        CANMessageClear
#endif
#ifdef ROM_CANIntEnable
#define MAP_CANIntEnable \
        ROM_CANIntEnable
#else
#define MAP_CANIntEnable \
        CANIntEnable
#endif
#ifdef ROM_CANIntDisable
#define MAP_CANIntDisable \
        ROM_CANIntDisable
#else
#define MAP_CANIntDisable \
        CANIntDisable
#endif
#ifdef ROM_CANIntStatus
#define MAP_CANIntStatus \
        ROM_CANIntStatus
#else
#define MAP_CANIntStatus \
        CANIntStatus
#endif
#ifdef ROM_CANRetryGet
#define MAP_CANRetryGet \
        ROM_CANRetryGet
#else
#define MAP_CANRetryGet \
        CANRetryGet
#endif
#ifdef ROM_CANRetrySet
#define MAP_CANRetrySet \
        ROM_CANRetrySet
#else
#define MAP_CANRetrySet \
        CANRetrySet
#endif
#ifdef ROM_CANErrCntrGet
#define MAP_CANErrCntrGet \
        ROM_CANErrCntrGet
#else
#define MAP_CANErrCntrGet \
        CANErrCntrGet
#endif
#ifdef ROM_CANBitRateSet
#define MAP_CANBitRateSet \
        ROM_CANBitRateSet
#else
#define MAP_CANBitRateSet \
        CANBitRateSet
#endif

//*****************************************************************************
//
// Macros for the Comparator API.
//
//*****************************************************************************
#ifdef ROM_ComparatorIntClear
#define MAP_ComparatorIntClear \
        ROM_ComparatorIntClear
#else
#define MAP_ComparatorIntClear \
        ComparatorIntClear
#endif
#ifdef ROM_ComparatorConfigure
#define MAP_ComparatorConfigure \
        ROM_ComparatorConfigure
#else
#define MAP_ComparatorConfigure \
        ComparatorConfigure
#endif
#ifdef ROM_ComparatorRefSet
#define MAP_ComparatorRefSet \
        ROM_ComparatorRefSet
#else
#define MAP_ComparatorRefSet \
        ComparatorRefSet
#endif
#ifdef ROM_ComparatorValueGet
#define MAP_ComparatorValueGet \
        ROM_ComparatorValueGet
#else
#define MAP_ComparatorValueGet \
        ComparatorValueGet
#endif
#ifdef ROM_ComparatorIntEnable
#define MAP_ComparatorIntEnable \
        ROM_ComparatorIntEnable
#else
#define MAP_ComparatorIntEnable \
        ComparatorIntEnable
#endif
#ifdef ROM_ComparatorIntDisable
#define MAP_ComparatorIntDisable \
        ROM_ComparatorIntDisable
#else
#define MAP_ComparatorIntDisable \
        ComparatorIntDisable
#endif
#ifdef ROM_ComparatorIntStatus
#define MAP_ComparatorIntStatus \
        ROM_ComparatorIntStatus
#else
#define MAP_ComparatorIntStatus \
        ComparatorIntStatus
#endif

//*****************************************************************************
//
// Macros for the EPI API.
//
//*****************************************************************************
#ifdef ROM_EPIIntStatus
#define MAP_EPIIntStatus \
        ROM_EPIIntStatus
#else
#define MAP_EPIIntStatus \
        EPIIntStatus
#endif
#ifdef ROM_EPIModeSet
#define MAP_EPIModeSet \
        ROM_EPIModeSet
#else
#define MAP_EPIModeSet \
        EPIModeSet
#endif
#ifdef ROM_EPIDividerSet
#define MAP_EPIDividerSet \
        ROM_EPIDividerSet
#else
#define MAP_EPIDividerSet \
        EPIDividerSet
#endif
#ifdef ROM_EPIConfigSDRAMSet
#define MAP_EPIConfigSDRAMSet \
        ROM_EPIConfigSDRAMSet
#else
#define MAP_EPIConfigSDRAMSet \
        EPIConfigSDRAMSet
#endif
#ifdef ROM_EPIConfigGPModeSet
#define MAP_EPIConfigGPModeSet \
        ROM_EPIConfigGPModeSet
#else
#define MAP_EPIConfigGPModeSet \
        EPIConfigGPModeSet
#endif
#ifdef ROM_EPIConfigHB8Set
#define MAP_EPIConfigHB8Set \
        ROM_EPIConfigHB8Set
#else
#define MAP_EPIConfigHB8Set \
        EPIConfigHB8Set
#endif
#ifdef ROM_EPIConfigHB16Set
#define MAP_EPIConfigHB16Set \
        ROM_EPIConfigHB16Set
#else
#define MAP_EPIConfigHB16Set \
        EPIConfigHB16Set
#endif
#ifdef ROM_EPIAddressMapSet
#define MAP_EPIAddressMapSet \
        ROM_EPIAddressMapSet
#else
#define MAP_EPIAddressMapSet \
        EPIAddressMapSet
#endif
#ifdef ROM_EPINonBlockingReadConfigure
#define MAP_EPINonBlockingReadConfigure \
        ROM_EPINonBlockingReadConfigure
#else
#define MAP_EPINonBlockingReadConfigure \
        EPINonBlockingReadConfigure
#endif
#ifdef ROM_EPINonBlockingReadStart
#define MAP_EPINonBlockingReadStart \
        ROM_EPINonBlockingReadStart
#else
#define MAP_EPINonBlockingReadStart \
        EPINonBlockingReadStart
#endif
#ifdef ROM_EPINonBlockingReadStop
#define MAP_EPINonBlockingReadStop \
        ROM_EPINonBlockingReadStop
#else
#define MAP_EPINonBlockingReadStop \
        EPINonBlockingReadStop
#endif
#ifdef ROM_EPINonBlockingReadCount
#define MAP_EPINonBlockingReadCount \
        ROM_EPINonBlockingReadCount
#else
#define MAP_EPINonBlockingReadCount \
        EPINonBlockingReadCount
#endif
#ifdef ROM_EPINonBlockingReadAvail
#define MAP_EPINonBlockingReadAvail \
        ROM_EPINonBlockingReadAvail
#else
#define MAP_EPINonBlockingReadAvail \
        EPINonBlockingReadAvail
#endif
#ifdef ROM_EPINonBlockingReadGet32
#define MAP_EPINonBlockingReadGet32 \
        ROM_EPINonBlockingReadGet32
#else
#define MAP_EPINonBlockingReadGet32 \
        EPINonBlockingReadGet32
#endif
#ifdef ROM_EPINonBlockingReadGet16
#define MAP_EPINonBlockingReadGet16 \
        ROM_EPINonBlockingReadGet16
#else
#define MAP_EPINonBlockingReadGet16 \
        EPINonBlockingReadGet16
#endif
#ifdef ROM_EPINonBlockingReadGet8
#define MAP_EPINonBlockingReadGet8 \
        ROM_EPINonBlockingReadGet8
#else
#define MAP_EPINonBlockingReadGet8 \
        EPINonBlockingReadGet8
#endif
#ifdef ROM_EPIFIFOConfig
#define MAP_EPIFIFOConfig \
        ROM_EPIFIFOConfig
#else
#define MAP_EPIFIFOConfig \
        EPIFIFOConfig
#endif
#ifdef ROM_EPIWriteFIFOCountGet
#define MAP_EPIWriteFIFOCountGet \
        ROM_EPIWriteFIFOCountGet
#else
#define MAP_EPIWriteFIFOCountGet \
        EPIWriteFIFOCountGet
#endif
#ifdef ROM_EPIIntEnable
#define MAP_EPIIntEnable \
        ROM_EPIIntEnable
#else
#define MAP_EPIIntEnable \
        EPIIntEnable
#endif
#ifdef ROM_EPIIntDisable
#define MAP_EPIIntDisable \
        ROM_EPIIntDisable
#else
#define MAP_EPIIntDisable \
        EPIIntDisable
#endif
#ifdef ROM_EPIIntErrorStatus
#define MAP_EPIIntErrorStatus \
        ROM_EPIIntErrorStatus
#else
#define MAP_EPIIntErrorStatus \
        EPIIntErrorStatus
#endif
#ifdef ROM_EPIIntErrorClear
#define MAP_EPIIntErrorClear \
        ROM_EPIIntErrorClear
#else
#define MAP_EPIIntErrorClear \
        EPIIntErrorClear
#endif

//*****************************************************************************
//
// Macros for the Ethernet API.
//
//*****************************************************************************
#ifdef ROM_EthernetIntClear
#define MAP_EthernetIntClear \
        ROM_EthernetIntClear
#else
#define MAP_EthernetIntClear \
        EthernetIntClear
#endif
#ifdef ROM_EthernetInitExpClk
#define MAP_EthernetInitExpClk \
        ROM_EthernetInitExpClk
#else
#define MAP_EthernetInitExpClk \
        EthernetInitExpClk
#endif
#ifdef ROM_EthernetConfigSet
#define MAP_EthernetConfigSet \
        ROM_EthernetConfigSet
#else
#define MAP_EthernetConfigSet \
        EthernetConfigSet
#endif
#ifdef ROM_EthernetConfigGet
#define MAP_EthernetConfigGet \
        ROM_EthernetConfigGet
#else
#define MAP_EthernetConfigGet \
        EthernetConfigGet
#endif
#ifdef ROM_EthernetMACAddrSet
#define MAP_EthernetMACAddrSet \
        ROM_EthernetMACAddrSet
#else
#define MAP_EthernetMACAddrSet \
        EthernetMACAddrSet
#endif
#ifdef ROM_EthernetMACAddrGet
#define MAP_EthernetMACAddrGet \
        ROM_EthernetMACAddrGet
#else
#define MAP_EthernetMACAddrGet \
        EthernetMACAddrGet
#endif
#ifdef ROM_EthernetEnable
#define MAP_EthernetEnable \
        ROM_EthernetEnable
#else
#define MAP_EthernetEnable \
        EthernetEnable
#endif
#ifdef ROM_EthernetDisable
#define MAP_EthernetDisable \
        ROM_EthernetDisable
#else
#define MAP_EthernetDisable \
        EthernetDisable
#endif
#ifdef ROM_EthernetPacketAvail
#define MAP_EthernetPacketAvail \
        ROM_EthernetPacketAvail
#else
#define MAP_EthernetPacketAvail \
        EthernetPacketAvail
#endif
#ifdef ROM_EthernetSpaceAvail
#define MAP_EthernetSpaceAvail \
        ROM_EthernetSpaceAvail
#else
#define MAP_EthernetSpaceAvail \
        EthernetSpaceAvail
#endif
#ifdef ROM_EthernetPacketGetNonBlocking
#define MAP_EthernetPacketGetNonBlocking \
        ROM_EthernetPacketGetNonBlocking
#else
#define MAP_EthernetPacketGetNonBlocking \
        EthernetPacketGetNonBlocking
#endif
#ifdef ROM_EthernetPacketGet
#define MAP_EthernetPacketGet \
        ROM_EthernetPacketGet
#else
#define MAP_EthernetPacketGet \
        EthernetPacketGet
#endif
#ifdef ROM_EthernetPacketPutNonBlocking
#define MAP_EthernetPacketPutNonBlocking \
        ROM_EthernetPacketPutNonBlocking
#else
#define MAP_EthernetPacketPutNonBlocking \
        EthernetPacketPutNonBlocking
#endif
#ifdef ROM_EthernetPacketPut
#define MAP_EthernetPacketPut \
        ROM_EthernetPacketPut
#else
#define MAP_EthernetPacketPut \
        EthernetPacketPut
#endif
#ifdef ROM_EthernetIntEnable
#define MAP_EthernetIntEnable \
        ROM_EthernetIntEnable
#else
#define MAP_EthernetIntEnable \
        EthernetIntEnable
#endif
#ifdef ROM_EthernetIntDisable
#define MAP_EthernetIntDisable \
        ROM_EthernetIntDisable
#else
#define MAP_EthernetIntDisable \
        EthernetIntDisable
#endif
#ifdef ROM_EthernetIntStatus
#define MAP_EthernetIntStatus \
        ROM_EthernetIntStatus
#else
#define MAP_EthernetIntStatus \
        EthernetIntStatus
#endif
#ifdef ROM_EthernetPHYWrite
#define MAP_EthernetPHYWrite \
        ROM_EthernetPHYWrite
#else
#define MAP_EthernetPHYWrite \
        EthernetPHYWrite
#endif
#ifdef ROM_EthernetPHYRead
#define MAP_EthernetPHYRead \
        ROM_EthernetPHYRead
#else
#define MAP_EthernetPHYRead \
        EthernetPHYRead
#endif

//*****************************************************************************
//
// Macros for the Flash API.
//
//*****************************************************************************
#ifdef ROM_FlashProgram
#define MAP_FlashProgram \
        ROM_FlashProgram
#else
#define MAP_FlashProgram \
        FlashProgram
#endif
#ifdef ROM_FlashUsecGet
#define MAP_FlashUsecGet \
        ROM_FlashUsecGet
#else
#define MAP_FlashUsecGet \
        FlashUsecGet
#endif
#ifdef ROM_FlashUsecSet
#define MAP_FlashUsecSet \
        ROM_FlashUsecSet
#else
#define MAP_FlashUsecSet \
        FlashUsecSet
#endif
#ifdef ROM_FlashErase
#define MAP_FlashErase \
        ROM_FlashErase
#else
#define MAP_FlashErase \
        FlashErase
#endif
#ifdef ROM_FlashProtectGet
#define MAP_FlashProtectGet \
        ROM_FlashProtectGet
#else
#define MAP_FlashProtectGet \
        FlashProtectGet
#endif
#ifdef ROM_FlashProtectSet
#define MAP_FlashProtectSet \
        ROM_FlashProtectSet
#else
#define MAP_FlashProtectSet \
        FlashProtectSet
#endif
#ifdef ROM_FlashProtectSave
#define MAP_FlashProtectSave \
        ROM_FlashProtectSave
#else
#define MAP_FlashProtectSave \
        FlashProtectSave
#endif
#ifdef ROM_FlashUserGet
#define MAP_FlashUserGet \
        ROM_FlashUserGet
#else
#define MAP_FlashUserGet \
        FlashUserGet
#endif
#ifdef ROM_FlashUserSet
#define MAP_FlashUserSet \
        ROM_FlashUserSet
#else
#define MAP_FlashUserSet \
        FlashUserSet
#endif
#ifdef ROM_FlashUserSave
#define MAP_FlashUserSave \
        ROM_FlashUserSave
#else
#define MAP_FlashUserSave \
        FlashUserSave
#endif
#ifdef ROM_FlashIntEnable
#define MAP_FlashIntEnable \
        ROM_FlashIntEnable
#else
#define MAP_FlashIntEnable \
        FlashIntEnable
#endif
#ifdef ROM_FlashIntDisable
#define MAP_FlashIntDisable \
        ROM_FlashIntDisable
#else
#define MAP_FlashIntDisable \
        FlashIntDisable
#endif
#ifdef ROM_FlashIntStatus
#define MAP_FlashIntStatus \
        ROM_FlashIntStatus
#else
#define MAP_FlashIntStatus \
        FlashIntStatus
#endif
#ifdef ROM_FlashIntClear
#define MAP_FlashIntClear \
        ROM_FlashIntClear
#else
#define MAP_FlashIntClear \
        FlashIntClear
#endif

